{"newspapers": {"cnbc": {"link": "https://www.cnbc.com/us-news/", "articles": [{"title": "Cash-strapped Biden campaign and top donors look to beef up fundraising, including through social media ads", "text": "Former Vice President Joe Biden, 2020 Democratic presidential candidate, speaks during a town hall event in Manchester, New Hampshire, U.S., on Wednesday, Oct. 9, 2019. Kate Flock | Bloomberg | Getty Images\n\nJoe Biden's cash-strapped presidential campaign has been talking to top donors about ways to beef up its fundraising strategy in the crucial fourth quarter, including a possible increase in spending on social media platforms such as Facebook, according to people familiar with the matter. They have also discussed a bigger emphasis on text messages that ask potential contributors to support Biden's campaign, said these people, who spoke on the condition of anonymity. The former vice president's campaign already sends texts to potential backers, and it is unclear what the message will be during the quarter. The development comes at a precarious time for Biden's campaign, as his fundraising and polling numbers weaken against an onslaught from progressive Sens. Elizabeth Warren and Bernie Sanders, and fellow moderate Pete Buttigieg, the mayor of South Bend, Indiana. The former vice president entered the race for the Democratic presidential nomination earlier this year as the clear front-runner. He enjoyed commanding leads in polls and got off to a fast money-making start with $21.5 million in the second quarter. However, he pulled in only $15.7 million in the third quarter, and had $8.9 million in cash on hand — both totals well behind Sanders, Warren and Buttigieg. He maintains a 6-point lead over Warren in Real Clear Politics' national polling average, but polls of early primary states such as Iowa and New Hampshire show Biden lagging or at risk of losing. The Iowa caucuses and the New Hampshire primary, both set for February, are the first contests of the 2020 election season.\n\nDigital grassroots struggles\n\nFundraising records illustrate Biden's biggest fundraising problem, namely appealing to the kinds of grassroots and small-dollar donors who fuel the Sanders and Warren campaigns. Beefing up digital efforts could help Biden's campaign in this regard. People familiar with the campaign's deliberations say boosting online efforts doesn't necessarily represent a major shift in strategy. Yet several of Biden's fundraisers believe that the campaign needs to improve its appeal to online donors. \"He can do more with online voters, but he's done surprisingly well,\" Biden supporter and former Pennsylvania Gov. Ed Rendell told CNBC in a recent interview. Other donors have been privately questioning where they can turn for sources of campaign funding as elections in the early primary states loom over the former vice president's organization. Earlier this month, Biden and his team rallied their donors at a summit in Philadelphia by calling on them to help them succeed on Super Tuesday primaries on March 3, when 40% of delegates are up for grabs. California, North Carolina and Texas all hold their primaries that day. A Biden spokesman did not return a request for comment. Biden's campaign has been behind in spending on Facebook ads that often entice contributors. Since he entered the race in April, Biden has spent $2.5 million on Facebook. Warren's campaign has spent $2.7 million and Sanders has bought $3.1 million in ads, Facebook's ad archive shows. Since January, President Donald Trump's campaign has spent $13.6 million on the platform. Read more: Candidates love to rip Big Tech companies, but their campaigns still pay them millions Throughout Biden's 2020 run, 35% of his donors have given under $200, while almost 65% are writing larger checks, according to the nonpartisan Center for Responsive Politics. Warren has been dominating the race in capturing smaller donations, which helped her raise $24.6 million in the third quarter and finish with $25.7 million on hand.\n\nThe super PAC question", "link": "https://www.cnbc.com/2019/10/29/biden-donors-discuss-digital-fundraising-as-they-see-a-drop-in-cash.html", "published": "2019-10-29T00:00:00"}, {"title": "Federal judge halts Alabama abortion law deemed the strictest in the nation", "text": "Pro-choice supporters protest in front of the Alabama State House as Alabama state Senate votes on the strictest anti-abortion bill in the United States at the Alabama Legislature in Montgomery, Alabama, U.S. May 14, 2019.\n\nA federal judge on Tuesday ruled that an Alabama abortion law considered the strictest in the country will not go into effect, citing Supreme Court precedents that forbid bans on abortion prior to fetal viability.\n\nSupporters of the Alabama law hope to use it to spur the Supreme Court to revisit those reproductive rights precedents, including the landmark decision Roe v. Wade. They expected lower courts to block the law.\n\nThe law criminalizes providing an abortion at any stage during a pregnancy, threatening doctors with prison sentences up to 99 years. It was set to take effect Nov. 15. The law provides no exception for rape or incest victims, but allows the procedure in cases where the patient's life is at risk.\n\n\"Enforcement of the ban would yield serious and irreparable harm, violating the right to privacy and preventing women from obtaining abortions in Alabama,\" District Judge Myron Thompson wrote. Thompson issued a temporary injunction that will prevent the law from going into effect until the court resolves the case in full.\n\nGov. Kay Ivey signed the law in May, acknowledging at the time that it was illegal under federal law and likely unenforceable.\n\nThe law came amid a flurry of other abortion restrictions passed in states led by Republicans attempting to test the Supreme Court's new conservative majority.\n\nThe nine-judge panel has five Republican appointees, including Justice Brett Kavanaugh, whom President Donald Trump selected to replace Justice Anthony Kennedy. Kavanaugh is generally seen as more conservative than his predecessor.\n\nThe ACLU, which has challenged a number of those laws, said in a statement that none of those measures have survived legal scrutiny.\n\n\"With this federal court ruling, it's official: None of the state abortion bans passed earlier this year are in effect,\" the group wrote in a post on Twitter.\n\nIn a statement, Attorney General Steve Marshall said that the district court's decision was \"not unexpected.\"\n\n\"As we have stated before, the State's objective is to advance our case to the U.S. Supreme Court where we intend to submit evidence that supports our argument that Roe and Casey were wrongly decided and that the Constitution does not prohibit states from protecting unborn children from abortion,\" he said.\n\nPlanned Parenthood v. Casey was a 1992 Supreme Court decision that affirmed the central holding of Roe v. Wade.\n\nRead more: ACLU and Planned Parenthood sue to bar Alabama abortion law from taking effect\n\nThe lawsuit was brought by Planned Parenthood and the American Civil Liberties Union in the United States District Court for Middle Alabama.﻿\n\nThe Supreme Court will hear a case this term challenging a Louisiana abortion law that opponents say will limit the state to one provider. The law requires doctors who perform abortions to have admitting privileges at hospitals within 30 miles of their clinics.", "link": "https://www.cnbc.com/2019/10/29/federal-court-strikes-down-alabama-abortion-law.html", "published": "2019-10-29T00:00:00"}, {"title": "Ford recalls 300,000 North American vehicles over safety concerns", "text": "The first production Ford Transit commercial van waits on the assembly line to be unveiled at the Ford Kansas City Assembly Plant April 30, 2014, in Claycomo, Missouri.\n\nFord announced Tuesday that it's recalling approximately 300,000 North American vehicles over safety concerns.\n\nThe company says a problem with the vehicles' driveshaft could result in vibration while driving, loss of motive power or damage to surrounding components like brake and fuel lines.\n\nThe recall affects 293,558 vehicles in the United States and territories, 22,960 in Canada and 2,744 in Mexico. The vehicles were manufactured between January 2014 and June 2017.\n\nFord says it has not received any reports of accident or injuries resulting from the issue.\n\nIn February the company announced three recalls that affected over 1.5 million vehicles in total.", "link": "https://www.cnbc.com/2019/10/29/ford-recalls-over-300000-north-american-vehicles-over-safety-concerns.html", "published": "2019-10-29T00:00:00"}, {"title": "Lockheed Martin's F-35 fighter program gets $34 billion Pentagon contract, its biggest yet", "text": "WASHINGTON — The Pentagon on Tuesday announced a $34 billion F-35 contract with Lockheed Martin, the largest contract yet for the defense firm's costly fighter program.\n\nThe deal is for the delivery of 478 of the aircraft.\n\nThe F-35, the crown jewel in the defense giant's portfolio, has become one of the most challenged programs in the history of the Department of Defense. The laundry list of setbacks includes faulty ejection seats, software delays and significant helmet-display issues. The program had an initial acquisition cost of $406.5 billion.\n\nYet the Pentagon touted reduced costs and a quicker timetable in its announcement Tuesday.\n\n\"This agreement achieves an average 12.7% cost reduction across all three variants and gets us below $80 million for a USAF F-35A by Lot 13 – one lot earlier than planned,\" Air Force Lt. Gen. Eric Fick, F-35 program executive officer, said Tuesday.\n\nLockheed Martin's fifth-generation F-35 comes in three variants, the F-35A for the U.S. Air Force, F-35B for the U.S. Marine Corps and F-35C for the U.S. Navy.\n\n\"The $34 billion agreement for F-35 low-rate initial production lots 12-14 includes the delivery of 478 F-35 aircraft,\" Ellen Lord, undersecretary of defense for acquisition and sustainment, said Tuesday at the Pentagon.\n\nThe contract announced Tuesday covers three lots of orders: 12, 13 and 14. Each one is essentially a batch of aircraft. The deal for lot 12 was for 149 jets, 160 for lot 13 and 169 for lot 14, for a total of 478 fighters for the U.S. military and allied partners.\n\nEllen Lord, the undersecretary of defense for acquisition and sustainment, reiterated the Department's commitment to the F-35 program at the Pentagon.\n\n\"I have full faith and confidence in the F-35 program and our ability to delivery F-35 combat capability anywhere in the world. Make no mistake, the F-35 is the world's most advanced, lethal and interoperable aircraft ever developed,\" Lord said.", "link": "https://www.cnbc.com/2019/10/29/lockheed-martin-costly-f-35-program-gets-biggest-pentagon-contract-yet.html", "published": "2019-10-29T00:00:00"}, {"title": "Warren calls out Facebook policy chief who worked for Bush in plan to clamp down on the 'revolving door'", "text": "Facebook vice president of global public policy Joel Kaplan and Facebook CEO Mark Zuckerberg leave the Elysee Presidential Palace after a meeting with French President Emmanuel Macron on May 23, 2018 in Paris, France.\n\nContinuing her attacks on Facebook, Sen. Elizabeth Warren, D-Mass., zeroed in on the company's policy chief Joel Kaplan, a former George W. Bush aide.\n\nWarren, a presidential candidate, mounted her latest strike in a series of tweets Tuesday announcing a plan to clamp down on the \"revolving door\" between the public and private sector. Warren said Facebook and other large corporations \"vacuum up anyone and everyone who leaves one of their government regulators in an obvious effort to leverage their new hire's political connections and use the allure of potential future job offers to extract favorable treatment.\" Warren's plan would bar \"giant corporations, banks, and market-dominant companies from hiring senior government officials for at least four years after they leave public office.\"\n\nAs Warren noted, Facebook is not the only company employing this tactic. Google recently hired former top Department of Homeland Security Official Miles Taylor, whom Buzzfeed News reported \"was involved in high-level discussions about immigration enforcement\" during the period of the agency's family separation policy, based on emails released through public records requests.\n\nIn her tweets, Warren said Facebook's lobbying spend has increased since its hiring of Kaplan.\n\n\"Since he was hired, Facebook spent over $71 million on lobbying — nearly 100 times what it had spent before Kaplan joined,\" Warren tweeted. As Facebook now faces at least three confirmed separate antitrust probes, Warren said \"Kaplan is flexing his DC rolodex to help Mark Zuckerbeg wage a closed-door charm offensive with Republican lawmakers.\"\n\nFacebook declined to comment on Warren's tweets.\n\nZuckerberg had private meetings with policymakers on both sides of the aisle during a trip to D.C. last month. Among the critics he met with was Sen. Josh Hawley, R-Mo., who has introduced a bill to remove tech's legal immunity from liability for their users' content unless they agree to submit to a third-party audit assessing the so-called political neutrality of their algorithms and content processes.\n\nKaplan was a strategic hire for Facebook, which has weathered attacks from conservatives who believe the company suppresses their voices due to a liberal slant among employees. People close to Kaplan told The Wall Street Journal that he is not a Trump supporter, but more of a traditional conservative. But his appearance at Justice Brett Kavanaugh's congressional hearing on sexual misconduct allegations last year stirred up Facebook employees who were angered by Kaplan's apparent show of support for the accused judge.\n\nAt Kaplan's urging, Facebook halted a project last year that was meant to encourage politically different users to engage in less-hostile ways, according to the Journal. Kaplan reportedly warned the feature could add fuel to claims of conservative bias.\n\nSubscribe to CNBC on YouTube.\n\nWATCH: Why Facebook's business model is only now coming under fire", "link": "https://www.cnbc.com/2019/10/29/warren-calls-out-facebook-policy-chief-former-bush-aide-joel-kaplan.html", "published": "2019-10-29T00:00:00"}]}, "nbcnews": {"link": "http://www.nbcnews.com/", "articles": []}, "yahoo": {"link": "https://news.yahoo.com/", "articles": [{"title": "Pullback in Syria could prolong war 'two or three decades,' former top diplomat says", "text": "A former top State Department official says that President Trump’s green light for a Turkish invasion into northern Syria was a “super-damaging” and “reckless” mistake that could prolong the war there for “probably two or three decades.”\n\n“President Trump said, ‘I want to end all these endless wars in the Middle East,’” said Richard Stengel, who served as undersecretary of state for public diplomacy under President Barack Obama, during an interview for the Yahoo News podcast “Skullduggery.”\n\n“Well, he just extended this war by probably two or three decades. ... I mean, it’s a kind of wild open season.”\n\nAs chief of public diplomacy between 2013 and 2016, Stengel spent much of his time trying to combat propaganda by the so-called Islamic State and Russia, a subject he writes about at length in his new book, “Information Wars: How We Lost the Global Battle Against Disinformation and What We Can Do About It.”\n\nWhatever gains have been made against the Islamic State, he said, could now be wiped out by an escalation in fighting among the various parties to the conflict. After talking to President Trump, Turkish President Recep Tayyip Erdogan ordered attacks against Syrian Kurdish fighters to create a “safe zone” on his country’s border with Syria. The Turks view the Syrian Kurds as having links to the PKK, a militant Kurdish group in Turkey that Erdogan views as terrorists. But they have been allied with the U.S. in the fight against ISIS and have borne the brunt of the combat, and casualties, for the past five years.\n\n“So the Turks and the Kurds will sort of go to war,” Stengel said. “The Russians will come in on the side of the Turks. The Iranians will continue to back Assad. I mean, to me, this is like this just pushed [the war] down the road.”\n\nThe most immediate danger, he said, is that thousands of Islamic State fighters who have been held in makeshift jails by the Kurds will now escape amid the fighting. “Absolutely, these guys can scurry back … and start committing terrorist acts in Europe. I mean, it's a really dangerous situation, which is why what Trump did is so reckless.”\n\nPhoto illustration: Yahoo News; photo: AP More\n\nAnother big winner from the Turkish assault is Russian President Vladimir Putin, who, Stengel said, has wanted all along to see more Syrian refugees pouring into Europe.\n\n“One of the arguments that I make in the book that I don’t hear picked up enough is that Putin’s indiscriminate bombing in the Syrian war when they went in in 2015 and ’16 was deliberate, to create more Syrian refugees to go through Turkey into Europe.”\n\nThe Russians — and their propaganda outlets — played up bogus stories such as one about a Russian girl allegedly raped by a Syrian refugee in Germany. Even though the story turned out to be false, the Internet Research Agency — the troll farm in St. Petersburg that was active in manipulating American social media platforms in the 2016 election — played up the claims, and “the Russian foreign minister talked about it within 15 minutes,” Stengel said.\n\nPutin “weaponized immigration in Germany … and that bled over into the U.S.,” he said.\n\nDownload or subscribe on iTunes: “Skullduggery” from Yahoo News\n\n_____\n\nDownload the Yahoo News app to customize your experience.\n\nRead more from Yahoo News:", "link": "https://news.yahoo.com/pullback-in-syria-could-prolong-war-two-or-three-decades-former-top-diplomat-says-192215706.html", "published": "2019-10-11T19:22:15+00:00"}, {"title": "To impeach or not to impeach? How Democrats should weigh the question.", "text": "\n\n\n\nIf Democrats were hoping for some shocking moment of revelation in Robert Mueller’s testimony yesterday — if they thought that maybe he’d plunk down a secret tape recording of President Trump and Vladimir Putin working out the Electoral College math for 2020, or that maybe Mueller would lift up his sleeves to display the tire marks from when Bill Barr tried to run him down on his way into the Capitol to testify — then they were again disappointed.\n\nMueller showed up, reluctantly, to the House side of the Capitol as exactly what he’d promised to be: the living embodiment of a dry, 448-page report and nothing more. Asking Mueller to reflect on the president’s state of mind was like expecting Siri to offer up her thoughts on Hegel.\n\nSo now Democrats are left with the same question that’s increasingly divided the party in recent weeks — and is almost certain to spill out into the party’s nomination contest, too.\n\nShould they impeach Donald Trump?\n\nLeaving political calculation aside for the moment, the answer depends, I suppose, on what you think impeachment is really for.\n\nIf you’ve grown up in America and you’re under, say, 30, you may not realize that impeachment wasn’t always bandied about as a remedy for bad presidents. Until Richard Nixon’s presidency collapsed in 1974 (he really was caught saying some pretty shocking things on tape), the idea of impeachment was mostly considered a historical oddity, like dueling with pistols, or mock turtlenecks.\n\nBut then came Bill Clinton and Monica Lewinsky and something called the Starr report, and like so much else in our politics, the extreme became the perfectly plausible. That’s especially true now, given what we know about the ugly circumstances of Trump’s election and his bullying of prosecutors and witnesses.\n\nNot since Clinton’s nadir has the possibility of impeachment taken on so much weight or relevance. Not since Nixon has any president watched members of his inner circle strike deals and go to jail as prosecutors circle the White House.\n\nEver since the Mueller report was submitted to the Justice Department (and then blatantly mischaracterized by the attorney general) in April, Mueller has overtly hinted that Congress should at least take up the question of impeachment.\n\nMueller takes the position that, since a sitting president can’t be indicted, it’s not up to investigators to reach any conclusion about presidential crimes; the Constitution gives that power expressly to the House.\n\nAs of this week, more than 90 Democrats in Congress have said they support impeaching Trump. Jerry Nadler, the New York congressman who chairs the Judiciary Committee, pointed this week to “very substantial evidence that the president is guilty of high crimes and misdemeanors,” which, as you probably know, happens to be the constitutional standard for removing a commander in chief.\n\nAll of which makes for a halfway compelling case, if you look at impeachment chiefly as a legal proceeding. This seems to be Mueller’s point, and Nadler’s too — that the purpose of impeachment is to provide a special court system for law-breaking presidents who are otherwise shielded from prosecution.\n\nBut impeachment isn’t just a trial mechanism. If it were, the Framers probably wouldn’t have left us with vague language about “high crimes and misdemeanors,” which could cover anything from murder to shoplifting. They might have left the trial business to a panel of actual judges, rather than handing the whole thing over to Congress, which was bound to be saddled with political biases and arcane rivalries.\n\nNo, impeachment isn’t just a legal remedy. Nor is it a way for opposition parties to negate the results of an election, no matter how clouded by allegations of wrongdoing.\n\nIt’s a political tool. It’s designed specifically to carry out the public will.\n\nImpeachment is there not principally to give the government a way to level charges, but to give the electorate a way to change its mind. It’s there so that if a duly elected president acts in a way that thoroughly appalls the voters and squanders their confidence in the integrity of the office, we don’t have to wait for the next election to send that president home.", "link": "https://news.yahoo.com/to-impeach-or-not-to-impeach-how-democrats-should-weigh-the-question-090000806.html", "published": "2019-07-25T09:00:08+00:00"}, {"title": "White House and U.S. official's wife sued over teen's death in U.K.", "text": "This article, White House and U.S. official's wife sued over teen's death in U.K., originally appeared on CBSNews.com\n\nNearly three months after 19-year-old in a head-on collision in England, lawyers for his family are suing the Trump administration, as well as Anne Sacoolas, the wife of an American official who admitted to causing the car crash.\n\nHarry's stepsister, Larna Harber, told CBS News it's a step they never wanted to take.\n\n\"In simple words: Get her back on the plane to the U.K. Donald Trump has the authorities to do that and I can't understand why they're not,\" she said. \"She's a mom of three children — what example is this setting to her three children? … It just seems wrong. I don't understand why when something seems so simple to us.\"\n\nSacoolas' immunity is a complex issue — one that reached the highest levels of government in the U.K. and led Harry's parents all the way to the White House, where they say they were \"shocked\" when President Trump asked them to meet with Sacoolas who was in an adjoining room.\n\n, saying they would only meet with her in the U.K. and only in the presence of grief counselors. That still hasn't happened.\n\nThe family said it will accuse the administration of \"lawless misconduct\" and will also be seeking damages. CBS News reached out to Sacoolas' lawyers and is waiting for a reply.\n\nHomes on fire after plane crashes in New Jersey\n\nAlexander Vindman, first current White House official to testify in impeachment inquiry\n\nSinger Allison Moorer's memoir \"Blood,\" on the legacy of her parents' murder-suicide", "link": "https://news.yahoo.com/white-house-u-officials-wife-050842389.html", "published": "2019-10-29T08:10:28+00:00"}, {"title": "National security official twice raised concerns on Ukraine", "text": "WASHINGTON (AP) â€” A military officer at the National Security Council twice raised concerns over the Trump administration's push to have Ukraine investigate Democrats and Joe Biden, according to testimony the official is prepared to deliver Tuesday in the House impeachment inquiry.\n\nAlexander Vindman, an Army lieutenant colonel who served in Iraq and, later, as a diplomat, is prepared to tell House investigators that he listened to President Donald Trump's July 25 call with new Ukraine President Volodymr Zelenskiy and reported his concerns to the NSC's lead counsel.\n\n\"I was concerned by the call,\" Vindman will say, according to prepared testimony obtained Monday night by The Associated Press. \"I did not think it was proper to demand that a foreign government investigate a U.S. citizen, and I was worried about the implications for the U.S. government's support of Ukraine.\"\n\nVindman will be the first current White House official set to appear as the impeachment inquiry reaches deeper into the Trump administration and Democrats prepare for the next, public phase of the probe.\n\nThe 20-year military officer will testify that he first reported his concerns after an earlier meeting July 10 in which U.S. Ambassador to the European Union Gordon Sondland stressed the importance of having Ukraine investigate the 2016 election as well as Burisma, a company linked to the family of 2020 Democratic presidential candidate Joe Biden.\n\nVindman says he told Sondland that \"his statements were inappropriate, that the request to investigate Biden and his son had nothing to do with national security, and that such investigations were not something the NSC was going to get involved in or push.\"\n\nThat account differs from Sondland's, a wealthy businessman who donated $1 million to Trump inauguration and testified before the impeachment investigators that no one from the NSC \"ever expressed any concerns.\" He also testified that he did not realize any connection between Biden and Burisma.\n\nFor the call between Trump and Zelenskiy, Vindman said he listened in the Situation Room with colleagues from the NSC and Vice President Mike Pence's office, and was concerned. He again reported his concerns to NSC's lead counsel, he said.\n\nHe wrote, \"I realized that if Ukraine pursued an investigation into the Bidens and Burisma, it would likely be interpreted as a partisan play which would undoubtedly result in Ukraine losing the bipartisan support it has thus far maintained. This would all undermine U.S. national security.\"\n\nVindman, who arrived in the United States as a 3-year-old from the former Soviet Union, served in various military and diplomatic posts before joining the NSC. He was the director for European affairs and a Ukraine expert under Fiona Hill, a former official who testified earlier in the impeachment probe. Hill worked for former national security adviser John Bolton.\n\nVindman will be a key witness. He attended Zelenskiy's inauguration with a delegation led by Energy Secretary Rick Perry, and he and Hill were both part of a Ukraine briefing with Sondland that others have testified irritated Bolton at the White House.\n\nVindland will testify that he is not the whistleblower, the still unnamed government official who filed the initial complaint over Trump's conversation with the Ukraine president that sparked the House impeachment inquiry. He will say he does not know who the whistleblower is.\n\n\"I am a patriot, and it is my sacred duty and honor to advance and defend OUR country, irrespective of party or politics,\" wrote Vindman, who was wounded in Iraq and awarded a Purple Heart.\n\n\"For over twenty years as an active duty United States military officer and diplomat, I have served this country in a nonpartisan manner, and have done so with the utmost respect and professionalism for both Republican and Democratic administrations,\" he wrote.\n\nThe testimony is expected the day after Speaker Nancy Pelosi announced the House will vote on a resolution to affirm the impeachment investigation, set rules for public hearings and outline the potential process for writing articles of impeachment against Trump. The vote is expected Thursday.\n\nAt its core, the impeachment inquiry is looking into Trump's call with Zelenskiy, when he asked the new Ukraine president for a \"favor\" in what Democrats say was a quid pro quo that could be an impeachable offense.", "link": "https://news.yahoo.com/wh-official-wont-testify-impeachment-120603391.html", "published": "2019-10-29T06:52:14+00:00"}, {"title": "How will ISIS leader al-Baghdadi's death affect the war on terror?", "text": "The 360 shows you diverse perspectives on the day’s top stories.\n\nWhat’s happening:\n\nPresident Trump on Sunday announced that American soldiers had carried out a raid in Syria that resulted in the death of the Islamic State terror group leader Abu Bakr al-Baghdadi.\n\n“Last night the United States brought the world’s No. 1 terrorist leader to justice,\" Trump said in a national address in which he described the details of the operation, including how al-Baghdadi died by igniting a suicide vest after being cornered by U.S. Special Operations forces.\n\nAl-Baghdadi led ISIS at the group’s peak when it controlled large swaths of territory in Iraq and Syria. He declared a caliphate in 2014, establishing a brutal system of theocratic rule.\n\nISIS gradually lost control over its territory in recent years and as the caliphate crumbled, al-Baghdadi had largely disappeared. Details of his location emerged after Iraqi intelligence officials captured one of his wives and a trusted courier, according to reports.\n\nWhy there’s debate:\n\nWhile there’s broad consensus that al-Baghdadi’s death is a positive development in the war on terror, there’s disagreement as to just how much it will affect ISIS operations. Some experts argue that he held a unique position in the group’s mythology that can’t be easily replaced. Al-Baghdadi’s death comes at a time when ISIS is splintered and has lost territory, which could hinder the group’s ability to unify behind a new ideological mission.\n\nOthers argue that his death won’t have a significant impact on ISIS’s operations. The group has become decentralized since losing its caliphate and no longer relied on al-Baghdadi’s leadership, experts say. His death could even “galvanize” these loosely associated cells, former Director of National Intelligence James Clapper warned. There are also fears that ISIS could see a resurgence, even without its leader, because of instability in the region driven by Trump’s decision to pull U.S. troops from northeast Syria and political unrest in Iraq.\n\nPerspectives\n\nMajor impact\n\nHis death robs ISIS of its figurehead\n\n“Al-Baghdadi was charismatic and competent, and whoever is named as his successor — like some of Baghdadi’s predecessors — may prove inept, unable to lead the caliphate’s remnants or inspire the new generation. And whatever the successor’s abilities, if he doesn’t want to share al-Baghdadi’s fate, he will need to hide and avoid communicating, and, thus, will face difficulties rebuilding his organization.” — Daniel Byman, Lawfare\n\nAl-Baghdadi’s symbolic power may mean he’s irreplaceable\n\n“Baghdadi is significant because he declared himself the caliph and the head of a caliphate that was a rallying cry for tens of thousands of extremists around the world. That will be hard to replace.” — Former U.S. antiterrorism envoy Brett McGurk to New Yorker\n\nHis death undermines the group’s recruitment pitch\n\n“His death is another strike against ISIS’s purported legitimacy, leaving it less able to claim to be any different from other violent extremist groups.” — Michael Safi, the Guardian\n\nA series of major defeats may mean ISIS is too weak to recover\n\n“That the Islamic State can easily survive the loss of its top leader is not as straightforward a proposition as seems to be widely believed. Mr. al-Baghdadi’s death, almost exactly seven months after the obliteration of the physical caliphate he built, comes at an exceptionally bad time. The organization is still struggling to recover from the collapse of its caliphate and the deaths of many top leaders. It is fragile, caught somewhere between being a proto-state and a full-fledged insurgency.” — Hassan Hassan, New York Times\n\nLimited impact\n\nISIS is strong enough to endure al-Baghdadi’s death\n\n“There was definitely a time when killing Baghdadi could’ve stopped ISIS’s rise. ... But I do think that the organization has moved well past Baghdadi in the same way that al-Qaeda moved past Osama bin Laden, to some extent. At this point — seven-plus years after the rise of ISIS — his death is far from a fatal strike against the organization.” — Former U.S. National Counterterrorism Center director Michael Leiter to Vox\n\n“Yet, despite what seems like good news, there are many indicators that Trump’s war on terror is short-sighted, un-strategic, and will — ultimately — increase threats from terrorism.” — Peter R. Neumann, Politico", "link": "https://news.yahoo.com/how-will-isis-leader-al-baghdadis-death-affect-the-war-on-terror-152614864.html", "published": "2019-10-29T15:26:14+00:00"}]}, "washingtonpost": {"link": "https://www.washingtonpost.com/", "articles": [{"title": "Another windstorm is set to complicate the battle against Northern California’s Kincade Fire", "text": "At the same time, conditions in Southern California, where the Getty Fire scorched the western edge of Los Angeles on Monday, are expected to be even more dangerous: The Storm Prediction Center warned of “extremely critical fire weather” beginning late Tuesday, when powerful Santa Ana winds are expected to whip across the region. A “long duration of low humidity and dry vegetation will make this a very critical event!” NWS Los Angeles said.\n\nAD\n\nAD\n\nThe dire weather warnings came just days after Gov. Gavin Newsom (D) declared a statewide emergency over wildfires — and amid an unprecedented wave of blackouts ordered by Pacific Gas & Electric, which has shut power to millions of customers in an effort to curb fire risk. Newsom has called the shut-offs “unacceptable.”\n\nThe state’s largest utility has told regulators that a jumper on one of its transmission towers broke close to where the Kincade Fire started, near Geyserville. The cause of the fire, which has been burning since Wednesday, is under investigation as 4,548 firefighters battle the blaze.\n\nMonday was a relatively quiet night on the front lines of the Kincade Fire. Cal Fire said Tuesday that the blaze barely grew overnight, though at 75,415 acres — an area more than twice the size of San Francisco — it is already California’s biggest fire of the year. The fire is now 15 percent contained, and officials said they expected it to burn until at least Nov. 7.\n\nAD\n\nAD\n\nFirefighters got a brief reprieve Monday when gusts died down, but they struggled to keep pace with the expanding blaze as winds changed direction, officials said. Even as officials lifted mandatory evacuation orders for parts of the county along the Pacific coast, they issued new evacuation warnings for a part of Lake County as the flames threatened to lurch eastward.\n\nAt least 124 structures have been destroyed in the fire, but no injuries of civilians have been reported — and there have been no deaths attributed to the blaze, which is burning in the same region where 22 people were killed in the Tubbs Fire in 2017. Officials said two firefighters had been injured, and one who was burned was in stable condition.\n\nEvacuations have largely gone smoothly as the nation’s most populous state adapts to increasing wildfires that many officials link to climate change. Sonoma County Sheriff Mark Essick said Tuesday at a news conference that Northern California residents will have to be patient as they await the chance to return home.\n\nAD\n\nAD\n\n“We’re going to have to kind of wait and see how the winds behave, how the fire behaves, before we can talk about repopulation,\" he said.\n\nEmergency responders on the other end of the state are trying to beat back a fast-moving brush fire that has consumed about 656 acres on the western edge of Los Angeles — a slight growth since Monday — and forced the evacuation of more than 7,000 homes. Fire officials said Tuesday that the Getty Fire was 5 percent contained. At least eight homes have been destroyed in the blaze, and six others have been damaged, officials said.\n\nThe International Association of Fire Fighters has more than 4,500 firefighters battling blazes across California, spokesman Timothy Burn said Tuesday. About 419 of those firefighters live in zones that have been evacuated.\n\nAD\n\nThe Getty and Kincade fires have been sparked by hurricane-like winds that for three years have caused fiery infernos to break out across the Golden State, which is coming to accept the blazes as the new normal. The gusts are known as Diablo winds in the San Francisco Bay area and Santa Ana winds in Southern California.\n\nAD\n\nRed flag warnings are up for the San Francisco Bay area and much of north-central California. The most volatile conditions in the vicinity of the Kincade Fire are forecast to occur from Tuesday through Wednesday afternoon, when winds in higher elevations may reach 65 mph.\n\nOffshore winds are also anticipated for lower elevations, which will lead to extremely dry air that is conducive for rapidly spreading wildfires. The ongoing offshore wind event, which is powered by the difference in air pressure between the Great Basin region and coastal California, is not anticipated to bring winds as high as the event over the weekend when the blaze began.\n\nAD\n\nNorthern California faced a blast of wind Wednesday and Thursday, and again over the weekend, when it was whipped with hurricane-force gusts. The coming surge this week, on Tuesday and Wednesday, is expected to be the third windstorm in quick succession.\n\nAD\n\nThe repeated high wind events are resulting in dry vegetation that will burn easily if any new fires ignite. In fact, forecasters in San Francisco said they have never before seen three red flag warning events in a seven-day period.\n\n“I’ve been in this business for 28 years; I’ve never seen anything like this,” said Steve Anderson, a meteorologist at the National Weather Service’s forecast office serving the San Francisco Bay area.\n\nAD\n\nResidents of Southern California, particularly from Los Angeles and Ventura counties south to San Diego, are gearing up for what could be a record-setting Santa Ana wind event beginning around midnight Tuesday night and continuing through Thursday. A red flag warning has been hoisted for the metro L.A. area, where winds could gust as high as 80 mph in higher elevations and canyons and reach 70 mph in valley locations.\n\nAD\n\nIn an ominous sign, the National Weather Service said early Tuesday that the upcoming event promises to be a “high end dangerous event.” One indicator of this is that the air pressure gradient, which controls how strong the winds will be, is forecast to be at record-high levels for late October and early November. In general, the greater the pressure gradient, the stronger the winds, since air flows from high to low pressure.\n\nGiven that there have been many Santa Ana wind events during this period, a record-setting event would be particularly dangerous and could cause significant damage of in the form of downed trees and power lines and minor structural damage, according to the NWS. Any fires that occur during this period could be nearly impossible to control.\n\nKim Bellware, Kayla Epstein, Derek Hawkins, Hannah Knowles and Jason Samenow contributed to this report.\n\nRead more:\n\nAD", "link": "https://www.washingtonpost.com/nation/2019/10/29/california-fires-kincade-fire-map-expands/", "published": "2019-10-29T00:00:00"}, {"title": "With a tweet and photo, Trump feeds intrigue about a classified military dog in Baghdadi raid", "text": "“Our canine, as they call — I call it a dog, a beautiful dog, a talented dog — was injured and brought back,” Trump said.\n\nThe Pentagon kept most details about the covert canine, including its name and background, on a tight leash. With nearly half of Americans owning a dog, according to a Gallup poll, it was unlikely that would last.\n\nAD\n\nAD\n\nThe “silent paw-fessional” would be thrust in the spotlight.\n\nOn Monday, Trump boosted the story, tweeting a declassified photograph of the furry special operator in an armored vest. In the image, its ears stand alert and its tongue hangs loose. It’s a male Belgian Malinois, one U.S. official said.\n\n“We have declassified a picture of the wonderful dog (name not declassified) that did such a GREAT JOB in capturing and killing the Leader of ISIS, Abu Bakr al-Baghdadi!” Trump wrote.\n\nThe decision followed nearly a whole day of the Pentagon wrestling with how much to say about the prized pooch.\n\nThree U.S. officials, speaking on the condition of anonymity due to sensitivity about the raid, said Monday that the dog’s identity was classified because of its affiliation with a classified unit. Releasing the name, they said, ran the risk of identifying the service members to which it was assigned.\n\nAD\n\nAD\n\nBy midday, the Pentagon’s top general was answering questions about the pup at a news conference.\n\n“We’re not releasing the name of the dog right now,” said Gen. Mark A. Milley, chairman of the Joint Chiefs of Staff. “The dog is still in theater.”\n\nMilley, standing alongside Defense Secretary Mark T. Esper, said the dog “performed a tremendous service, as they all do.” It was “slightly wounded and fully recovering” and had rejoined its handler.\n\n“We’re not going to release just yet photos or names of dogs or anything else,” Milley said.\n\n“Protecting his identity,” Esper interjected.\n\n“Protecting the dog’s identity,” Milley agreed.\n\nU.S. officials told several reporters the dog’s breed after the news conference. Its breed is common in Special Operations, where the Belgian Malinois is prized for its intelligence, athleticism and ferocity when required. Then came Trump’s tweet.\n\nAD\n\nAD\n\nThe dog’s participation in the operation adds a new hero to military lore. It follows in the paw prints of Cairo, who participated in the 2011 raid by Navy SEALs that killed Osama bin Laden, but dogs have served in the military for decades.\n\nWhile the dog in the latest raid was wounded, it will not be eligible for a Purple Heart or valor medal. The U.S. military once recognized canines for such exceptional service but suspended the practice amid complaints that it diminished the service of humans, according to an Army history of military dogs. Other countries, such as Britain, still award dogs for valor.\n\nAD", "link": "https://www.washingtonpost.com/national-security/2019/10/28/with-tweet-photo-trump-feeds-intrigue-about-classified-military-dog-baghdadi-raid/", "published": "2019-10-28T00:00:00"}, {"title": "Hong Kong bars democracy activist Joshua Wong from elections, underlining fears over freedoms", "text": "Explaining her decision in a letter Tuesday, Laura Aron, an official who manages elections, said there was a “consistent case” that Wong and his party believe “the independence of Hong Kong is an option” for the self-determination of its people. She added that it was “questionable whether Mr. Wong accepted the People’s Republic of China’s sovereignty” over Hong Kong. Aron had abruptly replaced another elections official, Dorothy Ma, who had been screening Wong’s candidacy but went on indefinite sick leave Thursday, according to the Electoral Affairs Commission.\n\nAD\n\nAD\n\nWong, the only candidate to be disqualified, has said he does not support Hong Kong’s independence, nor is it the official line of his party, Demosisto.\n\nExcluding Wong was “clearly a politically driven” decision, said Kenneth Chan, a professor at Hong Kong Baptist University who is running a project observing the local elections.\n\n“Obviously Joshua Wong's disqualification has a lot to do with his global profile as well as his activism in Hong Kong and overseas,” Chan said. “I believe that Beijing and the Hong Kong authorities now seek retaliation so that he would be kept outside the electoral systems.”\n\nA spokesman for the Hong Kong government said Wong “cannot possibly comply” with the requirements of electoral law and accused him of promoting “self-determination” or independence for Hong Kong.\n\nAD\n\nAD\n\n“There is no question of any political censorship, restriction of the freedom of speech or deprivation of the right to stand for elections as alleged by some members of the community,” the spokesman added.\n\nYet the decision was viewed as another setback for political freedoms in the former British colony, which over the past five months has been rocked by increasingly violent pro-democracy protests and an escalating police crackdown. The last-minute replacement of Ma, the official known as a returning officer who was responsible for screening Wong’s candidacy, also fueled concerns about the integrity of the process.\n\n“Beijing has deprived me of my right to institutional participation permanently, but my commitment to the democracy movement will never be eroded,” Wong said in a news conference. “This disqualification is because my name is Joshua Wong. Unless I change my name, they will continue disqualifying me.”\n\nAD\n\nAD\n\nHong Kong’s government is not democratically elected, but the city holds a quasi-democratic process to choose councilors in 18 local districts who advise the government. Democratic elections are a key demand of the protest movement.\n\nI become the only candidate banned from running in November’s District Council Election as Returning officer, Laura ARON ruled my nomination invalid this morning. It proved how Beijing manipulate the election with political cersorship and screening. pic.twitter.com/mwZNKUApFM — Joshua Wong 黃之鋒 😷 (@joshuawongcf) October 29, 2019\n\nPublic anger over deteriorating political rights in Hong Kong is expected to result in a backlash against pro-Beijing candidates in next month’s vote. A poll from the Chinese University of Hong Kong published by the Ming Pao newspaper on Thursday found 44.5 percent of people identified as pro-democracy, up from 27.9 percent in March. Only 6 percent of respondents supported the pro-Beijing camp.\n\nWong is not a central figure in the current unrest, which is largely leaderless. But he remains the most internationally recognized of the city’s democracy activists, having shot to fame as a leader of the 2014 Umbrella Movement calling for universal suffrage. He was jailed three times for his role in the protests and was most recently released in June, before being arrested again in August.\n\nAD\n\nAD\n\nChina has characterized Wong as a separatist, and President Xi Jinping has said any effort to challenge Chinese sovereignty over Hong Kong is a red line for the ruling Communist Party.\n\nAgnes Chow, another democracy activist and a member of Wong’s party, was disqualified from running in elections in 2018. A Hong Kong court overturned the ban in September, ruling that there was a breach of procedural fairness.\n\n“All this clearly contravenes the international standards of free and fair elections,” said Chan, the university professor. “The integrity of the entire electoral system is therefore undermined by such illiberal practices by the government.”\n\nWhile barring Wong from next month’s contest, authorities permitted other pro-democracy figures to run, including some with more-radical views and others who have been disqualified from previous elections.\n\nAD\n\nAD\n\nStill, Wong’s exclusion marks a snub for one of the Hong Kong’s best-known faces of protest. The 23-year-old has fashioned himself into an unofficial ambassador for the movement and has traveled to countries such as the United States and Germany to rally foreign support.\n\nHe has advocated passage of the Hong Kong Human Rights and Democracy Act, a bipartisan bill before the U.S. Congress that could impose sanctions or asset freezes on individuals judged to be restricting basic freedoms in the city. The legislation would mandate a review of the special status that the United States affords Hong Kong, under which the territory is treated as separate from mainland China.\n\nThe bill passed unanimously in the House and is being discussed in the Senate. It would need President Trump’s signature to become law.\n\nAD\n\nAD\n\nThe Chinese government has described the bill as interference in China’s internal affairs and vowed to retaliate if it is enacted.\n\nTimothy McLaughlin, Ryan Ho Kilpatrick and Tiffany Liang contributed to this report.\n\nAD", "link": "https://www.washingtonpost.com/world/asia_pacific/hong-kong-blocks-democracy-activist-joshua-wong-from-contesting-local-elections/2019/10/29/694b7df0-f632-11e9-b2d2-1f37c9d82dbb_story.html", "published": "2019-10-29T00:00:00"}, {"title": "Rep. Katie Hill (D) says she will become an advocate for victims of ‘revenge porn’", "text": "In a message Monday to supporters, she apologized for her “imperfections” and promised to “fight to ensure that no one else has to live through what I just experienced” in connection with the release of the intimate photos.\n\nAD\n\n“Some people call this electronic assault, digital exploitation. Others call it revenge porn. As a victim of it, I call it one of the worst things we can do to our sisters and our daughters,” Hill said in the video.\n\nAD\n\nShe continued: “I will not allow my experience to scare off other young women or girls from running for office. For the sake of all of us we cannot let that happen.”\n\nIn her resignation announcement Sunday, Hill said she was considering legal options over the photos and that “as long as I am in Congress, we’ll live fearful of what might come next and how much it will hurt.”\n\nAn ethics committee investigation could have lasted several months, pushing beyond the Dec. 6 filing deadline to run in the California primary on March 3.\n\nAD\n\nA senior Democratic aide said House Speaker Nancy Pelosi (D-Calif.) did not ask or demand that Hill resign. However, Pelosi issued a statement Sunday supportive of Hill’s decision to resign. She said Hill “has acknowledged errors in judgment that made her continued service as a Member untenable. We must ensure a climate of integrity and dignity in the Congress, and in all workplaces.”\n\nAD\n\nHill’s resignation, less than a year after flipping her seat from Republican hands in the 2018 midterms, will shake up the House race in her northeastern Los Angeles district.\n\nOn Monday, California State Assemblywoman Christy Smith announced she would run for the seat and released an array of endorsements from California Democratic leaders. Secretary of State Alex Padilla is also considering a run, according to a person familiar with internal deliberations who spoke on the condition of anonymity to describe the private discussions. Another person who has been floated as a possible contender is George T. Whitesides, chief executive of Virgin Galactic, the private space company.\n\nAD\n\nDespite the fact that the seat was previously held by a Republican, the district leans Democratic. Democrats expressed confidence they would win the open seat next year in a district that Hillary Clinton won by six percentage points in 2016.\n\nAD\n\nThat confidence is largely rooted in shifting demographics in the district, with more diverse and independent voters, said Darry Sragow, longtime Democratic strategist in California who runs the nonpartisan California Target Book.\n\n“A Republican who wants that seat back is clearly going to have to distance himself or herself from the president, assuming that the president is on the ticket in November 2020,” Sragow said. “You can’t say that a Republican . . . would never win, but it would be difficult given the trends and given the unpopularity of not only the president, but basically Republican stances on issues like immigration.”\n\nAD\n\nThe controversy surrounding Hill comes at a politically sensitive time for the Democratic leadership, which is trying to remain focused on the impeachment inquiry, Sragow said.\n\nAD\n\n“I think as a practical matter, the Democratic Party and Democratic leadership would be well advised to avoid getting stuck on a debate about something that is inherently intriguing at a time when there’s a much more serious issue to be wrestled with,” Sragow said.\n\nThe allegation raised against Hill would have been a major test of new ethics restrictions put in place after the #MeToo movement, prohibiting relationships between members of Congress and their staff.\n\nThe restrictions were put into place “with the understanding that there is a huge power dynamic between lawmakers and their staffers, and that can cause all sorts of ethical and moral problems,” said Jessica Levinson, ethics expert at the Loyola Law School in Los Angeles.\n\nAD\n\nAdditionally, she said, “you really want to be conducting the people’s business as opposed to personal business.”\n\nAD\n\nThe case involving Hill is a high-profile example of the threat of online abuse against individuals by weaponizing private images, said Mary Anne Franks, president of the Cyber Civil Rights Initiative, a nonprofit that focuses on fighting online abuse and discrimination.\n\nHill’s decision to consider pursuing legal action points to the challenges in seeking protection against the unwanted release of intimate photos. There is a patchwork of laws in 46 states that have different requirements as to what constitutes “revenge porn,” Franks said.\n\nMike DeBonis contributed to this report.\n\nAD", "link": "https://www.washingtonpost.com/politics/rep-katie-hill-d-says-she-will-become-an-advocate-for-victims-of-revenge-porn/2019/10/28/e5f96e76-f992-11e9-8906-ab6b60de9124_story.html", "published": "2019-10-28T00:00:00"}, {"title": "U.K. Parliament rejects Boris Johnson’s call for an early election on Dec. 12, but a pre-Brexit election remains likely", "text": "Johnson wants an election so he can have a chance to regain his lost parliamentary majority and fulfill his broken promise to get Brexit done, “do or die.”\n\n“Across the country, there is a widespread view that this Parliament has run its course,” Johnson told lawmakers Monday.\n\nAD\n\nHe fell way short of the two-thirds majority he needed for his early-election motion. Labour, the largest opposition party, has resisted the election push, and its lawmakers mostly abstained in the vote.\n\nAD\n\nSpeaking immediately afterward, the prime minister said, “We will not allow this paralysis to continue.”\n\nHe then confirmed that he will try to get a Dec. 12 election by introducing a new, one-line bill requiring only a simple majority.\n\nTwo anti-Brexit opposition parties — the Liberal Democrats and the Scottish National Party — have suggested they would back something close to that proposal, although they may object to the precise date.\n\nIn remarks that resembled a campaign speech, Johnson blamed Parliament, including rebel lawmakers from his Conservative Party, for blocking Brexit — again.\n\nAD\n\n“They made it inevitable that the people of this country would be retained in the E.U., against their will, for at least another three months, at a cost of another billion pounds a month,” Johnson said.\n\nHe charged, “They just want to delay Brexit and cancel Brexit.”\n\nAD\n\nLabour leader Jeremy Corbyn responded that Johnson was flailing about and failing to keep his word.\n\n“This is a prime minister who cannot be trusted,” Corbyn said. “Every promise this prime minister makes, he abandons.”\n\nCorbyn criticized Johnson for spending 100 million pounds ($129 million) of public money on an advertising campaign urging Britons to “Get Ready for Brexit” on Oct. 31.\n\nAD\n\nThe opposition leader also noted that Britain hasn’t had a general election in dark and dreary December since 1923.\n\nHe argued that the proposed timing by the Tories would have the effect of suppressing votes — discouraging participation by students who have left school for the holidays and elderly folk who might be less willing to vote on a day when the sun sets so early, at 3:50 p.m.\n\nLabour’s continued reticence to back elections, analysts say, is related to uncertainty about how the party would fare. Some within the upper ranks of the party want to go for it, believing that Corbyn is a proven campaigner. Others fear that the party’s messy position on Brexit may not go down well on the doorsteps.\n\nAD\n\nAD\n\nRecent polling puts Johnson’s Conservative Party 10 points ahead of Labour.\n\nHowever, as Theresa May, Johnson’s predecessor, knows only too well, polls can shift dramatically over the course of a campaign. In the last general election, in 2017, May went in expecting to get a clear majority and mandate, but ended up losing her parliamentary majority instead.\n\nDuring Johnson’s tenure, as long as the thrust of the opposition effort was to block a chaotic no-deal exit, Labour was able to hold together smaller opposition parties, as well as some members of Johnson’s Conservative Party, to frustrate the prime minister’s plans. But now that the threat of a no-deal Brexit has receded, the members of that alliance have diverged in their priorities.\n\nAD\n\nIn a series of tweets, Nicola Sturgeon, the first minister of Scotland and leader of the Scottish National Party, explained why she was supporting an early general election.\n\nAD\n\n“For all his bluster, Johnson would much prefer to fight an election with Brexit already ‘delivered,’ ” Sturgeon wrote. “An election now would instead force him to explain his failure to keep his 31 October ‘do or die’ promise and also defend his bad deal.”\n\nThe offer from Brussels to postpone Brexit another three months beyond the Oct. 31 deadline came in response to a formal request from Johnson, who was forced by his own lawmakers to ask for more time.\n\nJohnson successfully negotiated a divorce deal with E.U. leaders, and the House of Commons approved it in principle, but British lawmakers rejected Johnson’s fast-tracked timetable, saying they want more time to scrutinize and debate it.\n\nAD\n\nJohnson wrote back to the E.U. leadership on Monday: “I very much hope we can put this difficult period behind us.”\n\nAD\n\nAccording to the terms agreed to by the 27 remaining E.U. countries, Britain could still leave before the end of January if Parliament ratifies the separation deal ahead of time. In Europe’s jargon-loving precincts, that means Britain got a “flextension.”\n\n“The EU27 has agreed that it will accept the UK’s request for a #Brexit flextension until 31 January 2020,” European Council President Donald Tusk said Monday on Twitter. Ambassadors agreed to the deal without calling in national leaders for an in-person meeting, a sign that the decision was not especially controversial.\n\nAD\n\nEuropean leaders are tired of debating Brexit — especially at a moment when many European economies are flagging, extreme parties are still nipping at their heels and many citizens just want to move on. But leaders also fear the economic instability that would result from kicking Britain out before there’s an approved deal to manage the withdrawal.\n\nAD\n\nMonday’s delay was granted on the condition that British representatives in the E.U. agree not to obstruct the body’s decision-making while they linger inside the club, as Johnson has at times threatened to do.\n\nThe E.U. leaders also want Johnson to name a European commissioner, a kind of senior E.U. bureaucrat, because each member country is required to do so under E.U. treaties.\n\nAD\n\nNaming someone would be another politically symbolic defeat for Johnson. Not naming a commissioner would violate the E.U. treaties, potentially opening the bloc’s decisions to legal challenges and upsetting the Europeans.", "link": "https://www.washingtonpost.com/world/europe/eu-pushes-brexit-until-end-of-january-british-prime-minister-johnsons-request/2019/10/28/c53839cc-f967-11e9-9534-e0dbcc9f5683_story.html", "published": "2019-10-28T00:00:00"}]}}}